# Naive Bayes : Predicting survival from titanic crash

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv("/Users/premswaroop/Desktop/jupyter1/titanic.csv")
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [3]:
#dropping variables of no importance
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [11]:
#change sex column to numeric data type 
dummies=pd.get_dummies(df.Sex)
dummies.head(4)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0

In [12]:
df=pd.concat([df,dummies],axis='columns')
df.head(3)

   Survived  Pclass     Sex   Age     Fare  female  male
0         0       3    male  22.0   7.2500       0     1
1         1       1  female  38.0  71.2833       1     0
2         1       3  female  26.0   7.9250       1     0

In [14]:
# dropping sex column
df.drop(['Sex'],axis='columns',inplace=True)
df.head(3)

   Survived  Pclass   Age     Fare  female  male
0         0       3  22.0   7.2500       0     1
1         1       1  38.0  71.2833       1     0
2         1       3  26.0   7.9250       1     0

In [16]:
df.isna().sum()

Survived      0
Pclass        0
Age         177
Fare          0
female        0
male          0
dtype: int64

In [18]:
#so we have NA values in only one column i.e. Age
#let's replace with the mean of age column
df.Age=df.Age.fillna(df.Age.mean())
df.Age.isna().sum()

0

In [22]:
#i forgot inplace =true that's why error
inputs = df.drop('Survived',axis='columns',inplace=True)
target = df.Survived

AttributeError: 'DataFrame' object has no attribute 'Survived'

In [23]:
df.head(2)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0

In [36]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df,target,test_size=0.2)
X_train.shape

(712, 5)

In [37]:
len(X_test)

179

In [38]:
len(df)

891

In [39]:
len(target)

891

In [40]:
X_train

     Pclass        Age     Fare  female  male
169       3  28.000000  56.4958       0     1
477       3  29.000000   7.0458       0     1
819       3  10.000000  27.9000       0     1
82        3  29.699118   7.7875       1     0
433       3  17.000000   7.1250       0     1
..      ...        ...      ...     ...   ...
796       1  49.000000  25.9292       1     0
286       3  30.000000   9.5000       0     1
545       1  64.000000  26.0000       0     1
724       1  27.000000  53.1000       0     1
130       3  33.000000   7.8958       0     1

[712 rows x 5 columns]

In [41]:
# i am using gaussian naive bayes
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [42]:
model.fit(X_train,y_train)

GaussianNB()

In [43]:
model.score(X_test,y_test)

0.7988826815642458

In [44]:
X_test[0:10]

     Pclass        Age     Fare  female  male
340       2   2.000000  26.0000       0     1
283       3  19.000000   8.0500       0     1
370       1  25.000000  55.4417       0     1
776       3  29.699118   7.7500       0     1
241       3  29.699118  15.5000       1     0
247       2  24.000000  14.5000       1     0
331       1  45.500000  28.5000       0     1
369       1  24.000000  69.3000       1     0
56        2  21.000000  10.5000       1     0
29        3  29.699118   7.8958       0     1

In [45]:
y_test[0:10]

340    1
283    1
370    1
776    0
241    1
247    1
331    0
369    1
56     1
29     0
Name: Survived, dtype: int64